{
  "_name_or_path": "nlpaueb/legal-bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "LESSOR_NAME",
    "2": "LESSEE_NAME",
    "3": "PROPERTY_ADDRESS",
    "4": "LEASE_START_DATE",
    "5": "LEASE_END_DATE",
    "6": "RENT_AMOUNT",
    "7": "SECURITY_DEPOSIT_AMOUNT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "LEASE_END_DATE": 5,
    "LEASE_START_DATE": 4,
    "LESSEE_NAME": 2,
    "LESSOR_NAME": 1,
    "O": 0,
    "PROPERTY_ADDRESS": 3,
    "RENT_AMOUNT": 6,
    "SECURITY_DEPOSIT_AMOUNT": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
